 Consider a dataset of employee records that is available with an HR team in a CSV file. As a Data Engineer, you are required to create the database called STAFF and load the contents of the CSV file as a table called INSTRUCTORS. The headers of the available data are :Â¶

In [3]:
#Import required libraries
import pandas as pd
import sqlite3

In [5]:
#Intialize SQLite3 connection and entities
conn = sqlite3.connect('STAFF.db')
table_name = 'INSTRUCTORS'
attribute_names = ['ID','FNAME','LNAME','CITY','CCODE']

In [7]:
#Read Data from csv file
file_path = 'INSTRUCTOR.csv'
df = pd.read_csv(file_path,names=attribute_names)
#df

In [8]:
df.to_sql(table_name, conn, if_exists = 'replace', index =False)
print('Table is ready')

Table is ready

In [9]:
# Let us perform some SQL Queries
query_statement = f"SELECT * FROM {table_name}"
query_output = pd.read_sql(query_statement,conn)
print(query_statement)
print(query_output)

SELECT * FROM INSTRUCTORS
    ID    FNAME      LNAME      CITY CCODE
0    1      Rav      Ahuja   TORONTO    CA
1    2     Raul      Chong   Markham    CA
2    3     Hima  Vasudevan   Chicago    US
3    4     John     Thomas  Illinois    US
4    5    Alice      James  Illinois    US
5    6    Steve      Wells  Illinois    US
6    7  Santosh      Kumar  Illinois    US
7    8    Ahmed    Hussain  Illinois    US
8    9    Nancy      Allen  Illinois    US
9   10     Mary     Thomas  Illinois    US
10  11  Bharath      Gupta  Illinois    US
11  12   Andrea      Jones  Illinois    US
12  13      Ann      Jacob  Illinois    US
13  14     Amit      Kumar  NewDelhi    IN

In [15]:
query_statement = f"SELECT ID FROM {table_name}"
query_output = pd.read_sql(query_statement,conn)
print(query_output)

    ID
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11
11  12
12  13
13  14

In [16]:
""" Now try appending some data to the table. Consider the following.
a. Assume the ID is 100.
b. Assume the first name, FNAME, is John.
c. Assume the last name as LNAME, Doe.
d. Assume the city of residence, CITY is Paris.
e. Assume the country code, CCODE is FR."""

' Now try appending some data to the table. Consider the following.\na. Assume the ID is 100.\nb. Assume the first name, FNAME, is John.\nc. Assume the last name as LNAME, Doe.\nd. Assume the city of residence, CITY is Paris.\ne. Assume the country code, CCODE is FR.'

In [18]:
df = pd.DataFrame({'ID':100,'FNAME':'John','LNAME':'Doe',"CITY":'Paris','CCODE':'FR'},index=[0])
df

    ID FNAME LNAME   CITY CCODE
0  100  John   Doe  Paris    FR

In [19]:
df.to_sql(table_name,conn,if_exists = 'append',index=False)
print("Data Appended Successfully")

Data Appended Successfully

In [21]:
query_ = f"SELECT FNAME FROM {table_name}"
query_output = pd.read_sql(query_,conn)
print(query_output)

      FNAME
0       Rav
1      Raul
2      Hima
3      John
4     Alice
5     Steve
6   Santosh
7     Ahmed
8     Nancy
9      Mary
10  Bharath
11   Andrea
12      Ann
13     Amit
14     John

In [22]:
conn.close()